codes = {
    100: 'базовое уведомление',
    101: 'важное уведомление',
    200: 'OK',
    201: 'объект создан',
    202: 'подтверждение',
    400: 'неправильный запрос/JSON-объект',
    401: 'не авторизован',
    402: 'неправильный логин/пароль',
    403: 'пользователь заблокирован',
    404: 'пользователь/чат отсутствует на сервере',
    409: 'уже имеется подключение с указанным логином',
    410: 'адресат существует, но недоступен (offline)',
    500: 'ошибка сервера',
}
val_def = {
    "DEFAULT_IP_ADDRESS": "127.0.0.1",
    "DEFAULT_PORT": 7777,
    "MAX_CONNECTIONS": 5,
    "MAX_PACKAGE_LENGTH": 1024,
    "ENCODING": "utf-8",
    "ACTION": "action",
    "TIME": "time",
    "USER": "user",
    "ACCOUNT_NAME": "account_name",
    "PRESENCE": "presence",
    "RESPONSE": "response",
    "ERROR": "error"
}
